Revit 2024 API
RailingType.SecondaryHandrailHeight Property
 The height of the secondary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double SecondaryHandrailHeight { get; }
Visual Basic
Public ReadOnly Property SecondaryHandrailHeight As Double
	Get
Visual C++
public:
property double SecondaryHandrailHeight {
	double get ();
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The rail has no secondary hand rail.
See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace